lesson-one/lesson-one.org
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_THEME: serif
#+HTML_HEAD: <style>.reveal{font-size:26px !important;}</style>
#+OPTIONS: timestamp:nil toc:nil num:nil
:END:


#+TITLE: Class 1 · First Dart Program — Variables & Logic
#+AUTHOR: Shafiqur Rahman

* Welcome — This Is Day One
#+ATTR_REVEAL: :frag (appear)
  - This is the very first class of App Development with Flutter & AI
  - By the end of this course you will have a real app published on Google Play Store and BDapps
  - Today we dive straight into Dart, the language that powers Flutter


* Dart Fundamentals — Variables, Types & Control Flow
#+ATTR_REVEAL: :frag (appear)
** Master variables: var, final, const and when to use each
    #+BEGIN_SRC dart
      void main(){
        /// var infers the type automatically
        var studentName = 'Rahim';  // String
        var marks       = 87;       // int
        var gpa         = 3.85;     // double
        var isEnrolled  = true;     // bool

        /// final = assigned once at runtime
        final String school = 'BDapps Academy';

        /// const = compile-time constant
        const int passMark = 40;
      }
    #+END_SRC
** Dart Null Safety: the ? operator, ??, ??= and why they prevent app crashes
    #+BEGIN_SRC dart
      void main(){
        /// Nullable type — can hold null
        String? grade; // grade is null right now
        grade = 'A';   // now it has a value

        /// Null-aware operators
        String display = grade ?? 'Not graded'; // ?? = fallback if null
        print('$studentName scored $marks → $display');
        print('School: $school | Pass mark: $passMark');
      }
#+END_SRC
** Control flow: if/else and Dart 3 switch expressions with pattern matching
#+BEGIN_SRC dart
  void main(){

    String getGradeFeedbackIf(int score) {
      if (score >= 90 && score <= 100) {
        return 'Excellent! You got an A.';
      } else if (score >= 80 && score < 90) {
        return 'Great job! You got a B.';
      } else if (score >= 70 && score < 80) {
        return 'Good effort! You got a C.';
      } else if (score >= 0 && score < 70) {
        return 'Needs improvement. You got an F.';
      } else {
        return 'Invalid score provided.';
      }
    }

    print("Grade is: ${getGradeFeedbackIf(80)}");

    String getGradeFeedbackSwitch(int score) {                
        return switch (score) {                                                                                         
          >= 90 && <= 100 => 'Excellent! You got an A.',                                                                
          >= 80 && < 90   => 'Great job! You got a B.',              
          >= 70 && < 80   => 'Good effort! You got a C.',                                                           
          >= 0 && < 70    => 'Needs improvement. You got an F.',
          _               => 'Invalid score provided.', // Default wildcard case
        };
      }
      
      print("Grade is: ${getGradeFeedbackSwitch(90)}");  
  }

#+END_SRC
** Build a working CLI Grade Calculator by the end of class

#+BEGIN_SRC dart
  import 'dart:io';

  String calculateGrade(int marks) {
    return switch (marks) {
      >= 80 && <= 100 => 'A+',
      >= 70 && < 80   => 'A',
      >= 60 && < 70   => 'B',
      >= 50 && < 60   => 'C',
      >= 40 && < 50   => 'D',
      >= 0 && < 40    => 'F',
      _               => 'Invalid Score', // Handles negative numbers or > 100
    };
  }

  void main() {
    final students = <Map<String, dynamic>>[];

    print('=== Student Grade Calculator ===');
    for (int i = 1; i <= 3; i++) {
      stdout.write('Enter name for student $i: ');
      final name = stdin.readLineSync() ?? 'Unknown';
      
      stdout.write('Enter marks (0-100): ');
      // int.tryParse prevents crashes if the user types letters
      final marks = int.tryParse(stdin.readLineSync() ?? '0') ?? 0; 
      
      students.add({
        'name': name, 
        'marks': marks,
        'grade': calculateGrade(marks)
      });
    }

    print('\n--- Report Card ---');
    for (var s in students) {
      final status = s['marks'] >= 40 ? '✓ PASS' : '✗ FAIL';
      print('${s["name"]}: ${s["marks"]} → ${s["grade"]}  $status');
    }
    
    final avg = students.map((s) => s['marks'] as int).reduce((a, b) => a + b) / students.length;
    print('\nClass Average: ${avg.toStringAsFixed(1)}');
  }
#+END_SRC


* Why Dart? What Is Happening in the World
#+ATTR_REVEAL: :frag (appear)
  - Flutter & Dart are used by Google, Alibaba, BMW, eBay, and 1 million+ published apps
  - Dart was designed specifically for UI development — it compiles to native ARM code, JavaScript, and WebAssembly
  - Bangladesh's tech industry is growing 30% annually — Flutter devs are among the most in-demand skills
  - Null safety is now the industry standard; Swift, Kotlin, and Rust all enforce it
  - AI coding assistants like Claude Code make learning your first language faster than ever before
