lesson-one/lesson-one.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Class 1 · First Dart Program — Variables &amp; Logic</title>
<meta name="author" content="Shafiqur Rahman"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/serif.css" id="theme"/>

</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Class 1 · First Dart Program — Variables &amp; Logic</h1><p class="subtitle"></p>
<h2 class="author">Shafiqur Rahman</h2>
</section>

<section>
<section id="slide-org1032719">
<h2 id="org1032719">Welcome — This Is Day One</h2>
<ul>
<li class="fragment appear">This is the very first class of App Development with Flutter &amp; AI</li>
<li class="fragment appear">By the end of this course you will have a real app published on Google Play Store and BDapps</li>
<li class="fragment appear">Today we dive straight into Dart, the language that powers Flutter</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgdad206b">
<h2 id="orgdad206b">Dart Fundamentals — Variables, Types &amp; Control Flow</h2>
</section>
<section id="slide-orgb91250e">
<h3 id="orgb91250e">Master variables: var, final, const and when to use each</h3>
<div class="org-src-container">

<pre  class="src src-dart"   ><code trim><span style="color: #6ae4b9;">void</span> main(){
  <span style="color: #989898;">/// </span><span style="color: #989898;">var infers the type automatically
</span>  <span style="color: #b6a0ff;">var</span> <span style="color: #00d3d0;">studentName</span> = <span style="color: #79a8ff;">'Rahim'</span>;  <span style="color: #989898;">// </span><span style="color: #989898;">String
</span>  <span style="color: #b6a0ff;">var</span> <span style="color: #00d3d0;">marks</span>       = <span style="color: #00bcff;">87</span>;       <span style="color: #989898;">// </span><span style="color: #989898;">int
</span>  <span style="color: #b6a0ff;">var</span> <span style="color: #00d3d0;">gpa</span>         = <span style="color: #00bcff;">3.85</span>;     <span style="color: #989898;">// </span><span style="color: #989898;">double
</span>  <span style="color: #b6a0ff;">var</span> <span style="color: #00d3d0;">isEnrolled</span>  = <span style="color: #00bcff;">true</span>;     <span style="color: #989898;">// </span><span style="color: #989898;">bool
</span>
  <span style="color: #989898;">/// </span><span style="color: #989898;">final = assigned once at runtime
</span>  <span style="color: #b6a0ff;">final</span> <span style="color: #6ae4b9;">String</span> <span style="color: #00d3d0;">school</span> = <span style="color: #79a8ff;">'BDapps Academy'</span>;

  <span style="color: #989898;">/// </span><span style="color: #989898;">const = compile-time constant
</span>  <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">passMark</span> = <span style="color: #00bcff;">40</span>;
}
</code></pre>
</div>
</section>
<section id="slide-org3e6f6ce">
<h3 id="org3e6f6ce">Dart Null Safety: the ? operator, ??, ??= and why they prevent app crashes</h3>
<div class="org-src-container">

<pre  class="src src-dart"   ><code trim><span style="color: #6ae4b9;">void</span> main(){
  <span style="color: #989898;">/// </span><span style="color: #989898;">Nullable type &#8212; can hold null
</span>  <span style="color: #6ae4b9;">String</span>? grade; <span style="color: #989898;">// </span><span style="color: #989898;">grade is null right now
</span>  grade = <span style="color: #79a8ff;">'A'</span>;   <span style="color: #989898;">// </span><span style="color: #989898;">now it has a value
</span>
  <span style="color: #989898;">/// </span><span style="color: #989898;">Null-aware operators
</span>  <span style="color: #6ae4b9;">String</span> <span style="color: #00d3d0;">display</span> = grade ?? <span style="color: #79a8ff;">'Not graded'</span>; <span style="color: #989898;">// </span><span style="color: #989898;">?? = fallback if null
</span>  print(<span style="color: #79a8ff;">'</span><span style="color: #00d3d0;">$studentName</span><span style="color: #79a8ff;"> scored </span><span style="color: #00d3d0;">$marks</span><span style="color: #79a8ff;"> &#8594; </span><span style="color: #00d3d0;">$display</span><span style="color: #79a8ff;">'</span>);
  print(<span style="color: #79a8ff;">'School: </span><span style="color: #00d3d0;">$school</span><span style="color: #79a8ff;"> | Pass mark: </span><span style="color: #00d3d0;">$passMark</span><span style="color: #79a8ff;">'</span>);
}
</code></pre>
</div>
</section>
<section id="slide-org2b7f5a0">
<h3 id="org2b7f5a0">Control flow: if/else and Dart 3 switch expressions with pattern matching</h3>
<div class="org-src-container">

<pre  class="src src-dart"   ><code trim><span style="color: #6ae4b9;">void</span> main(){

  <span style="color: #6ae4b9;">String</span> <span style="color: #feacd0;">getGradeFeedbackIf</span>(<span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">score</span>) {
    <span style="color: #b6a0ff;">if</span> (score &gt;= <span style="color: #00bcff;">90</span> &amp;&amp; score &lt;= <span style="color: #00bcff;">100</span>) {
      <span style="color: #b6a0ff;">return</span> <span style="color: #79a8ff;">'Excellent! You got an A.'</span>;
    } <span style="color: #b6a0ff;">else</span> <span style="color: #b6a0ff;">if</span> (score &gt;= <span style="color: #00bcff;">80</span> &amp;&amp; score &lt; <span style="color: #00bcff;">90</span>) {
      <span style="color: #b6a0ff;">return</span> <span style="color: #79a8ff;">'Great job! You got a B.'</span>;
    } <span style="color: #b6a0ff;">else</span> <span style="color: #b6a0ff;">if</span> (score &gt;= <span style="color: #00bcff;">70</span> &amp;&amp; score &lt; <span style="color: #00bcff;">80</span>) {
      <span style="color: #b6a0ff;">return</span> <span style="color: #79a8ff;">'Good effort! You got a C.'</span>;
    } <span style="color: #b6a0ff;">else</span> <span style="color: #b6a0ff;">if</span> (score &gt;= <span style="color: #00bcff;">0</span> &amp;&amp; score &lt; <span style="color: #00bcff;">70</span>) {
      <span style="color: #b6a0ff;">return</span> <span style="color: #79a8ff;">'Needs improvement. You got an F.'</span>;
    } <span style="color: #b6a0ff;">else</span> {
      <span style="color: #b6a0ff;">return</span> <span style="color: #79a8ff;">'Invalid score provided.'</span>;
    }
  }

  print(<span style="color: #79a8ff;">"Grade is: </span><span style="color: #00d3d0;">${getGradeFeedbackIf(80)}</span><span style="color: #79a8ff;">"</span>);

  <span style="color: #6ae4b9;">String</span> <span style="color: #feacd0;">getGradeFeedbackSwitch</span>(<span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">score</span>) {                
      <span style="color: #b6a0ff;">return</span> <span style="color: #b6a0ff;">switch</span> (score) {                                                                                         
        &gt;= <span style="color: #00bcff;">90</span> &amp;&amp; &lt;= <span style="color: #00bcff;">100</span> =&gt; <span style="color: #79a8ff;">'Excellent! You got an A.'</span>,                                                                
        &gt;= <span style="color: #00bcff;">80</span> &amp;&amp; &lt; <span style="color: #00bcff;">90</span>   =&gt; <span style="color: #79a8ff;">'Great job! You got a B.'</span>,              
        &gt;= <span style="color: #00bcff;">70</span> &amp;&amp; &lt; <span style="color: #00bcff;">80</span>   =&gt; <span style="color: #79a8ff;">'Good effort! You got a C.'</span>,                                                           
        &gt;= <span style="color: #00bcff;">0</span> &amp;&amp; &lt; <span style="color: #00bcff;">70</span>    =&gt; <span style="color: #79a8ff;">'Needs improvement. You got an F.'</span>,
        _               =&gt; <span style="color: #79a8ff;">'Invalid score provided.'</span>, <span style="color: #989898;">// </span><span style="color: #989898;">Default wildcard case
</span>      };
    }

    print(<span style="color: #79a8ff;">"Grade is: </span><span style="color: #00d3d0;">${getGradeFeedbackSwitch(90)}</span><span style="color: #79a8ff;">"</span>);  
}

</code></pre>
</div>
</section>
<section id="slide-org69b27a3">
<h3 id="org69b27a3">Build a working CLI Grade Calculator by the end of class</h3>
<div class="org-src-container">

<pre  class="src src-dart"   ><code trim><span style="color: #f78fe7;">import</span> <span style="color: #79a8ff;">'dart:io'</span>;

<span style="color: #6ae4b9;">String</span> <span style="color: #feacd0;">calculateGrade</span>(<span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">marks</span>) {
  <span style="color: #b6a0ff;">return</span> <span style="color: #b6a0ff;">switch</span> (marks) {
    &gt;= <span style="color: #00bcff;">80</span> &amp;&amp; &lt;= <span style="color: #00bcff;">100</span> =&gt; <span style="color: #79a8ff;">'A+'</span>,
    &gt;= <span style="color: #00bcff;">70</span> &amp;&amp; &lt; <span style="color: #00bcff;">80</span>   =&gt; <span style="color: #79a8ff;">'A'</span>,
    &gt;= <span style="color: #00bcff;">60</span> &amp;&amp; &lt; <span style="color: #00bcff;">70</span>   =&gt; <span style="color: #79a8ff;">'B'</span>,
    &gt;= <span style="color: #00bcff;">50</span> &amp;&amp; &lt; <span style="color: #00bcff;">60</span>   =&gt; <span style="color: #79a8ff;">'C'</span>,
    &gt;= <span style="color: #00bcff;">40</span> &amp;&amp; &lt; <span style="color: #00bcff;">50</span>   =&gt; <span style="color: #79a8ff;">'D'</span>,
    &gt;= <span style="color: #00bcff;">0</span> &amp;&amp; &lt; <span style="color: #00bcff;">40</span>    =&gt; <span style="color: #79a8ff;">'F'</span>,
    _               =&gt; <span style="color: #79a8ff;">'Invalid Score'</span>, <span style="color: #989898;">// </span><span style="color: #989898;">Handles negative numbers or &gt; 100
</span>  };
}

<span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">main</span>() {
  <span style="color: #b6a0ff;">final</span> <span style="color: #00d3d0;">students</span> = &lt;<span style="color: #6ae4b9;">Map</span>&lt;<span style="color: #6ae4b9;">String</span>, <span style="color: #f78fe7;">dynamic</span>&gt;&gt;[];

  print(<span style="color: #79a8ff;">'=== Student Grade Calculator ==='</span>);
  <span style="color: #b6a0ff;">for</span> (<span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">i</span> = <span style="color: #00bcff;">1</span>; i &lt;= <span style="color: #00bcff;">3</span>; i++) {
    stdout.write(<span style="color: #79a8ff;">'Enter name for student </span><span style="color: #00d3d0;">$i</span><span style="color: #79a8ff;">: '</span>);
    <span style="color: #b6a0ff;">final</span> <span style="color: #00d3d0;">name</span> = stdin.readLineSync() ?? <span style="color: #79a8ff;">'Unknown'</span>;

    stdout.write(<span style="color: #79a8ff;">'Enter marks (0-100): '</span>);
    <span style="color: #989898;">// </span><span style="color: #989898;">int.tryParse prevents crashes if the user types letters
</span>    <span style="color: #b6a0ff;">final</span> <span style="color: #00d3d0;">marks</span> = <span style="color: #6ae4b9;">int</span>.tryParse(stdin.readLineSync() ?? <span style="color: #79a8ff;">'0'</span>) ?? <span style="color: #00bcff;">0</span>; 

    students.add({
      <span style="color: #79a8ff;">'name'</span>: name, 
      <span style="color: #79a8ff;">'marks'</span>: marks,
      <span style="color: #79a8ff;">'grade'</span>: calculateGrade(marks)
    });
  }

  print(<span style="color: #79a8ff;">'\n--- Report Card ---'</span>);
  <span style="color: #b6a0ff;">for</span> (<span style="color: #b6a0ff;">var</span> <span style="color: #00d3d0;">s</span> <span style="color: #b6a0ff;">in</span> students) {
    <span style="color: #b6a0ff;">final</span> <span style="color: #00d3d0;">status</span> = s[<span style="color: #79a8ff;">'marks'</span>] &gt;= <span style="color: #00bcff;">40</span> ? <span style="color: #79a8ff;">'&#10003; PASS'</span> : <span style="color: #79a8ff;">'&#10007; FAIL'</span>;
    print(<span style="color: #79a8ff;">'</span><span style="color: #00d3d0;">${s["name"]}</span><span style="color: #79a8ff;">: </span><span style="color: #00d3d0;">${s["marks"]}</span><span style="color: #79a8ff;"> &#8594; </span><span style="color: #00d3d0;">${s["grade"]}</span><span style="color: #79a8ff;">  </span><span style="color: #00d3d0;">$status</span><span style="color: #79a8ff;">'</span>);
  }

  <span style="color: #b6a0ff;">final</span> <span style="color: #00d3d0;">avg</span> = students.map((<span style="color: #00d3d0;">s</span>) =&gt; s[<span style="color: #79a8ff;">'marks'</span>] <span style="color: #f78fe7;">as</span> <span style="color: #6ae4b9;">int</span>).reduce((<span style="color: #00d3d0;">a</span>, <span style="color: #00d3d0;">b</span>) =&gt; a + b) / students.length;
  print(<span style="color: #79a8ff;">'\nClass Average: </span><span style="color: #00d3d0;">${avg.toStringAsFixed(1)}</span><span style="color: #79a8ff;">'</span>);
}
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org6c141f0">
<h2 id="org6c141f0">Why Dart? What Is Happening in the World</h2>
<ul>
<li class="fragment appear">Flutter &amp; Dart are used by Google, Alibaba, BMW, eBay, and 1 million+ published apps</li>
<li class="fragment appear">Dart was designed specifically for UI development — it compiles to native ARM code, JavaScript, and WebAssembly</li>
<li class="fragment appear">Bangladesh's tech industry is growing 30% annually — Flutter devs are among the most in-demand skills</li>
<li class="fragment appear">Null safety is now the industry standard; Swift, Kotlin, and Rust all enforce it</li>
<li class="fragment appear">AI coding assistants like Claude Code make learning your first language faster than ever before</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom/zoom.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown, RevealZoom, RevealNotes]
});

</script>
</body>
</html>
